Revit 2024 API
RailingType.SecondaryHandrailLateralOffset Property
 The lateral offset of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double SecondaryHandrailLateralOffset { get; }
Visual Basic
Public ReadOnly Property SecondaryHandrailLateralOffset As Double
	Get
Visual C++
public:
property double SecondaryHandrailLateralOffset {
	double get ();
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The rail has no secondary hand rail.
See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace